#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.frontend.random_pet.pet_name: Refreshing state... [id=humble-grackle]
module.backend.random_pet.pet_name: Refreshing state... [id=native-buzzard]
module.backend.module.asp.module.rgp.azurerm_resource_group.rgp: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/test-rgp-cis-neubank-use-001]
module.frontend.module.asp.module.rgp.azurerm_resource_group.rgp: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/test-rgp-cis-neubank-use-001]
module.backend.module.asp.azurerm_service_plan.asp: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/test-rgp-cis-neubank-use-001/providers/Microsoft.Web/serverFarms/test-asp-cis-neubank-use-001]
module.frontend.module.asp.azurerm_service_plan.asp: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/test-rgp-cis-neubank-use-001/providers/Microsoft.Web/serverFarms/test-asp-cis-neubank-use-001]
module.backend.azurerm_linux_web_app.backend_linux_web_app: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/test-rgp-cis-neubank-use-001/providers/Microsoft.Web/sites/test-backend-native-buzzard-service-cis-neubank-use-001]
module.frontend.azurerm_linux_web_app.backend_linux_web_app: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/test-rgp-cis-neubank-use-001/providers/Microsoft.Web/sites/test-backend-humble-grackle-service-cis-neubank-use-001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.backend.azurerm_linux_web_app.backend_linux_web_app must be replaced
-/+ resource "azurerm_linux_web_app" "backend_linux_web_app" {
      ~ app_settings                                   = {
          ~ "ENVIRONMENT" = "test" -> "prod"
        }
      ~ custom_domain_verification_id                  = (sensitive value)
      ~ default_hostname                               = "test-backend-native-buzzard-service-cis-neubank-use-001.azurewebsites.net" -> (known after apply)
      + hosting_environment_id                         = (known after apply)
      ~ id                                             = "/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/test-rgp-cis-neubank-use-001/providers/Microsoft.Web/sites/test-backend-native-buzzard-service-cis-neubank-use-001" -> (known after apply)
      ~ key_vault_reference_identity_id                = "SystemAssigned" -> (known after apply)
      ~ kind                                           = "app,linux" -> (known after apply)
      ~ name                                           = "test-backend-native-buzzard-service-cis-neubank-use-001" -> "prod-backend-native-buzzard-service-cis-neubank-use-001" # forces replacement
      ~ outbound_ip_address_list                       = [
          - "20.231.250.161",
          - "20.231.250.193",
          - "20.231.250.219",
          - "20.231.250.227",
          - "20.231.250.241",
          - "20.231.252.97",
          - "20.119.8.33",
        ] -> (known after apply)
      ~ outbound_ip_addresses                          = "20.231.250.161,20.231.250.193,20.231.250.219,20.231.250.227,20.231.250.241,20.231.252.97,20.119.8.33" -> (known after apply)
      ~ possible_outbound_ip_address_list              = [
          - "20.231.250.161",
          - "20.231.250.193",
          - "20.231.250.219",
          - "20.231.250.227",
          - "20.231.250.241",
          - "20.231.252.97",
          - "20.231.252.142",
          - "20.231.252.240",
          - "20.231.253.11",
          - "20.231.253.66",
          - "20.231.253.102",
          - "20.231.253.195",
          - "20.231.254.13",
          - "20.231.254.16",
          - "20.231.254.23",
          - "20.231.254.62",
          - "20.231.254.64",
          - "20.231.254.80",
          - "20.231.254.87",
          - "20.231.254.98",
          - "20.231.254.115",
          - "20.231.254.134",
          - "20.231.254.139",
          - "20.231.254.159",
          - "20.119.8.33",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses                 = "20.231.250.161,20.231.250.193,20.231.250.219,20.231.250.227,20.231.250.241,20.231.252.97,20.231.252.142,20.231.252.240,20.231.253.11,20.231.253.66,20.231.253.102,20.231.253.195,20.231.254.13,20.231.254.16,20.231.254.23,20.231.254.62,20.231.254.64,20.231.254.80,20.231.254.87,20.231.254.98,20.231.254.115,20.231.254.134,20.231.254.139,20.231.254.159,20.119.8.33" -> (known after apply)
      ~ resource_group_name                            = "test-rgp-cis-neubank-use-001" -> "prod-rgp-cis-neubank-use-001" # forces replacement
      ~ service_plan_id                                = "/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/test-rgp-cis-neubank-use-001/providers/Microsoft.Web/serverFarms/test-asp-cis-neubank-use-001" -> (known after apply)
      ~ site_credential                                = (sensitive value)
        tags                                           = {
            "Environment" = "Test"
            "Owner"       = "first.last@company.com"
            "Project"     = "Mortgage Calculator"
        }
      + zip_deploy_file                                = (known after apply)
        # (9 unchanged attributes hidden)

      ~ site_config {
          - auto_heal_enabled                       = false -> null
          ~ default_documents                       = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
              - "hostingstart.html",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled          = false -> (known after apply)
          ~ health_check_eviction_time_in_min       = 0 -> (known after apply)
          ~ linux_fx_version                        = "GO|1.19" -> (known after apply)
          ~ remote_debugging_version                = "VS2019" -> (known after apply)
          ~ scm_type                                = "None" -> (known after apply)
          ~ worker_count                            = 1 -> (known after apply)
            # (14 unchanged attributes hidden)

          ~ application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.frontend.azurerm_linux_web_app.backend_linux_web_app must be replaced
-/+ resource "azurerm_linux_web_app" "backend_linux_web_app" {
      ~ app_settings                                   = {
          ~ "ENVIRONMENT" = "test" -> "prod"
        }
      ~ custom_domain_verification_id                  = (sensitive value)
      ~ default_hostname                               = "test-backend-humble-grackle-service-cis-neubank-use-001.azurewebsites.net" -> (known after apply)
      + hosting_environment_id                         = (known after apply)
      ~ id                                             = "/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/test-rgp-cis-neubank-use-001/providers/Microsoft.Web/sites/test-backend-humble-grackle-service-cis-neubank-use-001" -> (known after apply)
      ~ key_vault_reference_identity_id                = "SystemAssigned" -> (known after apply)
      ~ kind                                           = "app,linux" -> (known after apply)
      ~ name                                           = "test-backend-humble-grackle-service-cis-neubank-use-001" -> "prod-backend-humble-grackle-service-cis-neubank-use-001" # forces replacement
      ~ outbound_ip_address_list                       = [
          - "20.231.250.161",
          - "20.231.250.193",
          - "20.231.250.219",
          - "20.231.250.227",
          - "20.231.250.241",
          - "20.231.252.97",
          - "20.119.8.33",
        ] -> (known after apply)
      ~ outbound_ip_addresses                          = "20.231.250.161,20.231.250.193,20.231.250.219,20.231.250.227,20.231.250.241,20.231.252.97,20.119.8.33" -> (known after apply)
      ~ possible_outbound_ip_address_list              = [
          - "20.231.250.161",
          - "20.231.250.193",
          - "20.231.250.219",
          - "20.231.250.227",
          - "20.231.250.241",
          - "20.231.252.97",
          - "20.231.252.142",
          - "20.231.252.240",
          - "20.231.253.11",
          - "20.231.253.66",
          - "20.231.253.102",
          - "20.231.253.195",
          - "20.231.254.13",
          - "20.231.254.16",
          - "20.231.254.23",
          - "20.231.254.62",
          - "20.231.254.64",
          - "20.231.254.80",
          - "20.231.254.87",
          - "20.231.254.98",
          - "20.231.254.115",
          - "20.231.254.134",
          - "20.231.254.139",
          - "20.231.254.159",
          - "20.119.8.33",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses                 = "20.231.250.161,20.231.250.193,20.231.250.219,20.231.250.227,20.231.250.241,20.231.252.97,20.231.252.142,20.231.252.240,20.231.253.11,20.231.253.66,20.231.253.102,20.231.253.195,20.231.254.13,20.231.254.16,20.231.254.23,20.231.254.62,20.231.254.64,20.231.254.80,20.231.254.87,20.231.254.98,20.231.254.115,20.231.254.134,20.231.254.139,20.231.254.159,20.119.8.33" -> (known after apply)
      ~ resource_group_name                            = "test-rgp-cis-neubank-use-001" -> "prod-rgp-cis-neubank-use-001" # forces replacement
      ~ service_plan_id                                = "/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/test-rgp-cis-neubank-use-001/providers/Microsoft.Web/serverFarms/test-asp-cis-neubank-use-001" -> (known after apply)
      ~ site_credential                                = (sensitive value)
        tags                                           = {
            "Environment" = "Test"
            "Owner"       = "first.last@company.com"
            "Project"     = "Mortgage Calculator"
        }
      + zip_deploy_file                                = (known after apply)
        # (9 unchanged attributes hidden)

      ~ site_config {
          - auto_heal_enabled                       = false -> null
          ~ default_documents                       = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
              - "hostingstart.html",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled          = false -> (known after apply)
          ~ health_check_eviction_time_in_min       = 0 -> (known after apply)
          ~ linux_fx_version                        = "GO|1.19" -> (known after apply)
          ~ remote_debugging_version                = "VS2019" -> (known after apply)
          ~ scm_type                                = "None" -> (known after apply)
          ~ worker_count                            = 1 -> (known after apply)
            # (14 unchanged attributes hidden)

          ~ application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.backend.module.asp.azurerm_service_plan.asp must be replaced
-/+ resource "azurerm_service_plan" "asp" {
      ~ id                           = "/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/test-rgp-cis-neubank-use-001/providers/Microsoft.Web/serverFarms/test-asp-cis-neubank-use-001" -> (known after apply)
      ~ kind                         = "linux" -> (known after apply)
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ name                         = "test-asp-cis-neubank-use-001" -> "prod-asp-cis-neubank-use-001" # forces replacement
      ~ reserved                     = true -> (known after apply)
      ~ resource_group_name          = "test-rgp-cis-neubank-use-001" -> "prod-rgp-cis-neubank-use-001" # forces replacement
        tags                         = {
            "Environment" = "Test"
            "Owner"       = "first.last@company.com"
            "Project"     = "Mortgage Calculator"
        }
      ~ worker_count                 = 1 -> (known after apply)
      - zone_balancing_enabled       = false -> null
        # (4 unchanged attributes hidden)
    }

  # module.frontend.module.asp.azurerm_service_plan.asp must be replaced
-/+ resource "azurerm_service_plan" "asp" {
      ~ id                           = "/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/test-rgp-cis-neubank-use-001/providers/Microsoft.Web/serverFarms/test-asp-cis-neubank-use-001" -> (known after apply)
      ~ kind                         = "linux" -> (known after apply)
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ name                         = "test-asp-cis-neubank-use-001" -> "prod-asp-cis-neubank-use-001" # forces replacement
      ~ reserved                     = true -> (known after apply)
      ~ resource_group_name          = "test-rgp-cis-neubank-use-001" -> "prod-rgp-cis-neubank-use-001" # forces replacement
        tags                         = {
            "Environment" = "Test"
            "Owner"       = "first.last@company.com"
            "Project"     = "Mortgage Calculator"
        }
      ~ worker_count                 = 1 -> (known after apply)
      - zone_balancing_enabled       = false -> null
        # (4 unchanged attributes hidden)
    }

  # module.backend.module.asp.module.rgp.azurerm_resource_group.rgp must be replaced
-/+ resource "azurerm_resource_group" "rgp" {
      ~ id       = "/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/test-rgp-cis-neubank-use-001" -> (known after apply)
      ~ name     = "test-rgp-cis-neubank-use-001" -> "prod-rgp-cis-neubank-use-001" # forces replacement
        tags     = {
            "Environment" = "Test"
            "Owner"       = "first.last@company.com"
            "Project"     = "Mortgage Calculator"
        }
        # (1 unchanged attribute hidden)
    }

  # module.frontend.module.asp.module.rgp.azurerm_resource_group.rgp must be replaced
-/+ resource "azurerm_resource_group" "rgp" {
      ~ id       = "/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/test-rgp-cis-neubank-use-001" -> (known after apply)
      ~ name     = "test-rgp-cis-neubank-use-001" -> "prod-rgp-cis-neubank-use-001" # forces replacement
        tags     = {
            "Environment" = "Test"
            "Owner"       = "first.last@company.com"
            "Project"     = "Mortgage Calculator"
        }
        # (1 unchanged attribute hidden)
    }

Plan: 6 to add, 0 to change, 6 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "shortenv" but a value was
found in file "test.auto.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dbwest, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Prod`*